using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace LINQ_PART2
{
    class Program
    {
        static void Main(string[] args)
        {
            /*Профессия C#-разработчик Язык C# Модуль 15.Основы LINQ.Часть 2 
            */
        }
    }
}

/*
Мы продолжаем с вами изучение LINQ.

В этом модуле мы узнаем, как это можно применить его для решения следующих задач:

-соединение нескольких коллекций в одну, поиск общих элементов, соединение с проверкой на уникальность; 
-выполнение различных агрегирующих и арифметических операций с элементами коллекции, поиск максимального, минимального и среднего значений;
-группировка элементов по определенным признакам и многое другое.
*/
